# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\akashbad\Documents\6.115\Final Project\LauncherController.cydsn\LauncherController.cyprj
# Date: Mon, 12 May 2014 20:18:35 GMT
#set_units -time ns
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyMASTER_CLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CapSense_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 9} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_clock -name {CapSense_IntClock(fixed-function)} -period 83.333333333333329 -waveform {0 20.8333333333333} [get_pins {ClockBlock/dclk_glb_ff_0}]
create_generated_clock -name {Target_UART_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 625 1251} -nominal_period 13020.833333333332 [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\akashbad\Documents\6.115\Final Project\LauncherController.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\akashbad\Documents\6.115\Final Project\LauncherController.cydsn\LauncherController.cyprj
# Date: Mon, 12 May 2014 20:18:18 GMT
